DataProcessors/Renault_АРМ_ContactCenter.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_АРМ_ContactCenter</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_АРМ_ContactCenter/Forms/ФормаВыбораОтветственного/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОтделПродаж = Renault_КонтактЦентр_Общий.ПолучитьОтделАвтосалона();
	Отдел = Справочники.CRM_Отделы.ПустаяСсылка();
	ОбновитьТаблицу(Отдел);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(Элементы.ТаблицаСтатусы.ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтделПриИзменении(Элемент)
	
	//Если ЗначениеЗаполнено(ОтборОтдел) Тогда
	//	Отдел = ОтборОтдел;
	//Иначе
	//	Отдел = Renault_КонтактЦентр_Общий.ПолучитьОтделАвтосалона();
	//КонецЕсли;
	
	ОбновитьТаблицу(ОтборОтдел);
	
КонецПроцедуры

Процедура ОбновитьТаблицу(Отдел)
	
	ТаблицаСотрудников = ПолучитьТаблицуСсылокНаСотрудниковПоОтделу(Отдел);
	МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	ТаблицаСтат = Renault_КонтактЦентр_Общий.ПолучитьСтатусыСотрудников(МассивСотрудников);
	//ТаблицаСтат.Колонки.Добавить("Статус");
	Для Каждого Строка Из ТаблицаСтат Цикл
		СтрокаТаб = ТаблицаСотрудников.Найти(Строка.Сотрудник, "Сотрудник");
		Если Строка.АктивностьПользователя = Ложь Тогда
			СтрокаТаб.Статус = "Offline";
		Иначе
			СтрокаТаб.Статус = "Online";
		КонецЕсли;
	КонецЦикла;
	
	//ЗначениеВРеквизитФормы(ТаблицаСтат, "ТаблицаСтатусы");
	ЗначениеВРеквизитФормы(ТаблицаСотрудников, "ТаблицаСтатусы");
	
КонецПроцедуры

Функция ПолучитьТаблицуСсылокНаСотрудниковПоОтделу(Отдел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Сотрудник,
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел КАК Отдел,
	|	""       "" КАК Статус
	|ИЗ
	|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|ГДЕ
	|	ВЫБОР КОГДА &Отдел = ЗНАЧЕНИЕ(Справочник.CRM_Отделы.ПустаяСсылка) ТОГДА ИСТИНА
	|		ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел = &Отдел
	|	КОНЕЦ
	|	И НЕ Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник ЕСТЬ NULL 
	|	И Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник.ФлагУволен = ЛОЖЬ";
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица;
	
КонецФункции
